Revit 2024 API
TableSectionData.IsCellOverridden Method (Int32, Int32)
 Indicates if the cell is overridden or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsCellOverridden(
	int nRow,
	int nCol
)
Visual Basic
Public Function IsCellOverridden ( _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool IsCellOverridden(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
nCol
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
TableSectionData Class
IsCellOverridden Overload
Autodesk.Revit.DB Namespace